#Область ОписаниеПеременных
&НаКлиенте
Перем АвторизацияУспешна;

&НаКлиенте
Перем СчетчикОшибок;
#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	WSHShell = Новый COMОбъект("WScript.Shell");
	WSHShell.SendKeys("% ");
	WSHShell.SendKeys("{DOWN}{DOWN}{DOWN}{DOWN}{ENTER}");
	
	АвторизацияУспешна = Ложь;
	СчетчикОшибок = 0;
	Элементы.ГруппаКапча.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если АвторизацияУспешна = Ложь Тогда
		ЗавершитьРаботуСистемы();
	Иначе
		Закрыть();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Вход(Команда)
	Если СчетчикОшибок = 5 Тогда
		СчетчикОшибок = 0;
		ОбработкаКапчи();
	Иначе
		ОбработкаВхода();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьКапчу(Команда)
	Если Элементы.КапчаДекор.Заголовок = ВводКапчи Тогда
		Элементы.ГруппаКапча.Видимость = Ложь;
		Элементы.ГруппаРеквизиты.Видимость = Истина;
		Элементы.ГруппаКоманды.Видимость = Истина;
	Иначе
		ОбработкаКапчи();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьПароль(Команда)
	Если Элементы.Пароль.РежимПароля = Истина Тогда
		Элементы.Пароль.РежимПароля = Ложь;
		Элементы.ПоказатьСкрытьПароль.Картинка = БиблиотекаКартинок.СкрытьПароль;
	Иначе
		Элементы.Пароль.РежимПароля = Истина;
		Элементы.ПоказатьСкрытьПароль.Картинка = БиблиотекаКартинок.ПоказатьПароль;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОбработкаВхода()
	Если Не ЗначениеЗаполнено(Логин) или Не ЗначениеЗаполнено(Пароль) Тогда
		ОбработкаОшибки("Введите данные");
	Иначе
		ТекущийПользователь = НайтиТекущегоПользователя(Логин);
		Если ТекущийПользователь = Неопределено Тогда
			ОбработкаОшибки("Такого пользователя не существует");
		Иначе
			Если Пароль = ТекущийПользователь.Пароль Тогда
				АвторизацияУспешна = Истина;
				Закрыть();
			Иначе
				ОбработкаОшибки("Пароль неверный");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиТекущегоПользователя(Параметры)
	ТекущийПользователь = Справочники.Пользователи.ПоискТекущегоПользователя(Логин);
	
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Возврат ТекущийПользователь;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбработкаОшибки(Ошибка)
	СчетчикОшибок = СчетчикОшибок + 1;
	Элементы.ОшибкаДекор.Заголовок = Ошибка;
КонецПроцедуры

&НаСервере
Процедура ОбработкаКапчи()
	ВводКапчи = "";
	Элементы.ОшибкаДекор.Заголовок = "";
	Элементы.ГруппаРеквизиты.Видимость = Ложь;
	Элементы.ГруппаКоманды.Видимость = Ложь;
	Элементы.ГруппаКапча.Видимость = Истина;
	СтрокаКапча = ОбщийМодуль.ГенерацияСлучайнойСтроки();
	Элементы.КапчаДекор.Заголовок = СтрокаКапча;
КонецПроцедуры
#КонецОбласти